----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/carrawu/Documents/harvard/ec1152/proj4_save_switch.log
  log type:  text
 opened on:   2 May 2019, 21:20:24

. 
. import delimited "export.csv", clear
(16 vars, 3,220 obs)

. 
. rename county* *

. 
. merge 1:1 geoid using atlas_training.dta, gen(mtrain)
(note: variable geoid was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           702
        from master                       702  (mtrain==1)
        from using                          0  (mtrain==2)

    matched                             2,518  (mtrain==3)
    -----------------------------------------

. 
. replace personageyears5onwardslang = personageyears5onwardslang/pop
(3,218 real changes made, 700 to missing)

. replace personageyears25onwardsedu = personageyears25onwardsedu/pop
(3,218 real changes made, 700 to missing)

. replace v4 = v4/pop
(3,218 real changes made, 700 to missing)

. replace personageyears18onwardsarm = personageyears18onwardsarm/pop
(3,218 real changes made, 700 to missing)

. replace v6 = v6/pop
variable v6 was long now double
(3,218 real changes made, 700 to missing)

. replace personageyears5onwardsnati = personageyears5onwardsnati/pop
(3,218 real changes made, 700 to missing)

. replace v8 = v8/pop
(3,218 real changes made, 700 to missing)

. replace persongenderfemale = persongenderfemale/pop
variable persongenderfemale was long now double
(3,218 real changes made, 700 to missing)

. replace v13 = v13/pop
(3,218 real changes made, 700 to missing)

. replace v14 = v14/pop
variable v14 was byte now float
(3,218 real changes made, 700 to missing)

. replace v15 = v15/pop
(3,218 real changes made, 700 to missing)

. replace v16 = v16/pop
variable v16 was long now double
(3,218 real changes made, 700 to missing)

. 
. replace housingunitoccupancystatus = housingunitoccupancystatus/housing
variable housingunitoccupancystatus was long now double
(3,220 real changes made, 702 to missing)

. replace housingunitcashrentstatusw = housingunitcashrentstatusw/housing
variable housingunitcashrentstatusw was long now double
(3,220 real changes made, 702 to missing)

. 
. // foreach j in `vars' {
. // replace `j' = 0 if `j' == -1 | missing(`j')
. // replace `j' = 100000*`j' / pop
. // }
. 
. save project4.dta, replace
file project4.dta saved

. 
. sum personageyears5onwardslang personageyears25onwardsedu v4 personageyears18onwardsarm v6 persona
> geyears5onwardsnati v8 persongenderfemale v13 v14 v15 v16 housingunitoccupancystatus housingunitca
> shrentstatusw

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
personagey~g |      2,518    .0023283    .0045491   6.14e-16   .0767448
personagey~u |      2,518    .0061354     .006269   3.03e-15    .133211
          v4 |      2,518    .0028614    .0210205   4.88e-16   .5565223
personagey~m |      2,518    .0692684     .021975   .0063262   .1968316
          v6 |      2,518    .1948594    .0450406   .0513707   .3393418
-------------+---------------------------------------------------------
personagey~i |      2,518    .0501503    .0596825   8.67e-15   .5583771
          v8 |      2,518    .0583751    .1466602   9.52e-15   .9159936
persongend~e |      2,518    .5051076    .0269536    .298614   .5962448
         v13 |      2,518    .0096834     .009656   1.73e-15   .1130681
         v14 |      2,518    -.000033    .0000261  -.0000998  -1.01e-07
-------------+---------------------------------------------------------
         v15 |      2,518    .0396131    .0212971    .007726   .2115321
         v16 |      2,518    .0967177    .0414841   .0191131   .3454842
housinguni~s |      2,518    .5994186    .0919306    .190777   .9270437
housinguni~w |      2,518    .2233599    .0860562   .0363948   .7572495

. 
. reg kfr_pooled_p25 personageyears5onwardslang personageyears25onwardsedu v4 personageyears18onward
> sarm v6 personageyears5onwardsnati v8 persongenderfemale v13 v14 v15 v16 housingunitoccupancystatu
> s housingunitcashrentstatusw, r

Linear regression                               Number of obs     =      1,259
                                                F(14, 1244)       =      45.25
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3907
                                                Root MSE          =     .04059

--------------------------------------------------------------------------------------------
                           |               Robust
            kfr_pooled_p25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
personageyears5onwardslang |   .0006521   .2245274     0.00   0.998    -.4398421    .4411462
personageyears25onwardsedu |    .959231   .3199475     3.00   0.003     .3315348    1.586927
                        v4 |   .1303771   .0613735     2.12   0.034     .0099701     .250784
personageyears18onwardsarm |   .0175424     .06025     0.29   0.771    -.1006605    .1357452
                        v6 |   .2511425   .0432035     5.81   0.000     .1663827    .3359023
personageyears5onwardsnati |   .2784252   .0424764     6.55   0.000     .1950919    .3617584
                        v8 |  -.0917123    .014639    -6.26   0.000    -.1204322   -.0629924
        persongenderfemale |  -.3521451   .0647142    -5.44   0.000    -.4791061    -.225184
                       v13 |  -.2895867   .2197384    -1.32   0.188    -.7206856    .1415121
                       v14 |  -604.4421   66.72411    -9.06   0.000    -735.3463   -473.5379
                       v15 |  -.9051331   .1488797    -6.08   0.000    -1.197216   -.6130501
                       v16 |   .8773028   .0700571    12.52   0.000     .7398597    1.014746
housingunitoccupancystatus |   .1739442   .0181916     9.56   0.000     .1382546    .2096338
housingunitcashrentstatusw |   .0177967   .0236206     0.75   0.451    -.0285438    .0641372
                     _cons |   .3513955   .0354895     9.90   0.000     .2817695    .4210214
--------------------------------------------------------------------------------------------

. 
. // predict rank_hat_ols
. // scatter kfr_pooled_p25 rank_hat_ols
. 
. reg kfr_pooled_p25 personageyears5onwardslang personageyears25onwardsedu v4 personageyears18onward
> sarm v6 personageyears5onwardsnati v8 persongenderfemale v13 v14 v15 v16 housingunitoccupancystatu
> s housingunitcashrentstatusw P_* if training == 1, r

Linear regression                               Number of obs     =      1,259
                                                F(132, 1123)      =          .
                                                Prob > F          =          .
                                                R-squared         =     0.8700
                                                Root MSE          =     .01974

--------------------------------------------------------------------------------------------
                           |               Robust
            kfr_pooled_p25 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
personageyears5onwardslang |  -.2836402   .2256258    -1.26   0.209    -.7263357    .1590553
personageyears25onwardsedu |  -.5219928   .2791863    -1.87   0.062    -1.069778    .0257927
                        v4 |   -.110784   .0427783    -2.59   0.010    -.1947184   -.0268496
personageyears18onwardsarm |  -.1839299   .0456581    -4.03   0.000    -.2735147   -.0943452
                        v6 |   .1242825   .0328894     3.78   0.000     .0597509     .188814
personageyears5onwardsnati |   .0571109   .0709611     0.80   0.421    -.0821203    .1963421
                        v8 |  -.0610943   .0502846    -1.21   0.225    -.1597567    .0375681
        persongenderfemale |   .0216523   .0380598     0.57   0.570     -.053024    .0963286
                       v13 |  -.0379662   .1325372    -0.29   0.775    -.2980147    .2220823
                       v14 |  -123.2935   41.90801    -2.94   0.003    -205.5204   -41.06673
                       v15 |  -.4942093   .0996136    -4.96   0.000    -.6896589   -.2987596
                       v16 |   .1305647   .0629309     2.07   0.038     .0070892    .2540401
housingunitoccupancystatus |   .0221947   .0136124     1.63   0.103    -.0045138    .0489032
housingunitcashrentstatusw |   .0005343   .0175011     0.03   0.976    -.0338043    .0348728
                       P_1 |  -.0001748   .0000723    -2.42   0.016    -.0003166    -.000033
                       P_2 |   .0000125   .0000876     0.14   0.887    -.0001594    .0001844
                       P_3 |   .0001152   .0000834     1.38   0.168    -.0000485    .0002788
                       P_4 |   .0000588   .0000966     0.61   0.543    -.0001307    .0002482
                       P_5 |  -.0001676   .0001057    -1.59   0.113    -.0003751    .0000398
                       P_6 |  -.0000322   .0000965    -0.33   0.738    -.0002215    .0001571
                       P_7 |   .0000126   .0000562     0.23   0.822    -.0000976    .0001228
                       P_8 |  -.0000638   .0001149    -0.56   0.579    -.0002893    .0001617
                       P_9 |   .0001434   .0001043     1.38   0.169    -.0000612     .000348
                      P_10 |  -.0049591   .0028207    -1.76   0.079    -.0104936    .0005754
                      P_11 |  -.0015398   .0036089    -0.43   0.670    -.0086207    .0055412
                      P_12 |  -.0009176   .0005512    -1.66   0.096    -.0019991     .000164
                      P_13 |   .0010543   .0005692     1.85   0.064    -.0000624    .0021711
                      P_14 |   .0009368   .0005545     1.69   0.091    -.0001512    .0020248
                      P_15 |   .0009074   .0005532     1.64   0.101    -.0001779    .0019928
                      P_16 |   .0009186    .000551     1.67   0.096    -.0001625    .0019996
                      P_17 |    .000813   .0007648     1.06   0.288    -.0006876    .0023136
                      P_18 |   .0000995   .0004658     0.21   0.831    -.0008144    .0010135
                      P_19 |   .0001009   .0004657     0.22   0.828    -.0008128    .0010147
                      P_20 |   .0001443   .0004652     0.31   0.756    -.0007684     .001057
                      P_21 |   .0002187   .0004294     0.51   0.611    -.0006237    .0010612
                      P_22 |  -.0002092   .0004289    -0.49   0.626    -.0010507    .0006323
                      P_23 |   -.000219   .0004293    -0.51   0.610    -.0010613    .0006232
                      P_24 |  -1.26e-06   2.24e-07    -5.64   0.000    -1.70e-06   -8.22e-07
                      P_25 |   .0000282   .0002933     0.10   0.924    -.0005474    .0006037
                      P_26 |   .1994937   .0501443     3.98   0.000     .1011067    .2978807
                      P_27 |  -.0463648   .0445849    -1.04   0.299    -.1338439    .0411142
                      P_28 |  -.0388775   .0692092    -0.56   0.574    -.1746714    .0969164
                      P_29 |   1.34e-06   2.32e-07     5.79   0.000     8.88e-07    1.80e-06
                      P_30 |  -1.61e-06   4.57e-07    -3.51   0.000    -2.50e-06   -7.08e-07
                      P_31 |   -.059268    .043534    -1.36   0.174    -.1446851    .0261491
                      P_32 |   .1502281   .0401062     3.75   0.000     .0715366    .2289196
                      P_33 |  -.0434737   .0344347    -1.26   0.207    -.1110373    .0240899
                      P_34 |  -.1183923   .1611037    -0.73   0.463    -.4344905    .1977059
                      P_35 |  -.2189275   .1621959    -1.35   0.177    -.5371685    .0993136
                      P_36 |  -.1310219   .2306827    -0.57   0.570    -.5836395    .3215957
                      P_37 |   .1796053   .1724891     1.04   0.298    -.1588319    .5180424
                      P_38 |   .2981089   .1725069     1.73   0.084    -.0403633     .636581
                      P_39 |   .2684419   .1704364     1.58   0.116    -.0659677    .6028514
                      P_40 |   .4323341   .2667374     1.62   0.105    -.0910257    .9556938
                      P_41 |    .000959   .0010573     0.91   0.365    -.0011156    .0030336
                      P_42 |   6.18e-06   9.06e-06     0.68   0.496    -.0000116     .000024
                      P_43 |  -.0358495   .0193522    -1.85   0.064      -.07382    .0021211
                      P_44 |  -.0365253   .0297458    -1.23   0.220    -.0948889    .0218382
                      P_45 |   -.162703   .0353434    -4.60   0.000    -.2320495   -.0933565
                      P_46 |   .0482493   .0150526     3.21   0.001     .0187149    .0777837
                      P_47 |   -.028039   .0202982    -1.38   0.167    -.0678656    .0117876
                      P_48 |    .000182   .0001516     1.20   0.230    -.0001155    .0004795
                      P_49 |   -.013009    .006637    -1.96   0.050    -.0260313    .0000133
                      P_50 |   .2212472   .1601816     1.38   0.167    -.0930417    .5355361
                      P_51 |   7.31e-06   3.29e-06     2.22   0.026     8.60e-07    .0000138
                      P_52 |  -5.91e-06   3.29e-06    -1.79   0.073    -.0000124    5.56e-07
                      P_53 |  -.1500319   .0735505    -2.04   0.042    -.2943437     -.00572
                      P_54 |  -2.28e-06   3.45e-06    -0.66   0.508    -9.04e-06    4.48e-06
                      P_55 |  -.0072228   .0039947    -1.81   0.071    -.0150608    .0006151
                      P_56 |  -.0126564   .0032845    -3.85   0.000    -.0191008    -.006212
                      P_57 |   .0021806   .0006829     3.19   0.001     .0008407    .0035205
                      P_58 |  -.0009451   .0006396    -1.48   0.140       -.0022    .0003099
                      P_59 |   .0000245   .0000303     0.81   0.419    -.0000349    .0000838
                      P_60 |   6.88e-06   6.69e-06     1.03   0.304    -6.24e-06      .00002
                      P_61 |   .0000185    .000035     0.53   0.598    -.0000502    .0000872
                      P_62 |  -3.10e-07   6.55e-07    -0.47   0.636    -1.59e-06    9.75e-07
                      P_63 |   .0036865   .0009894     3.73   0.000     .0017451    .0056278
                      P_64 |   .0054278   .0020101     2.70   0.007     .0014839    .0093718
                      P_65 |  -.0059509   .0037652    -1.58   0.114    -.0133386    .0014367
                      P_66 |  -.0000179   .0000161    -1.11   0.265    -.0000495    .0000136
                      P_67 |  -.0000867   .0000995    -0.87   0.384    -.0002819    .0001086
                      P_68 |   .0026619   .0009611     2.77   0.006     .0007763    .0045476
                      P_69 |  -.0002898    .000162    -1.79   0.074    -.0006076     .000028
                      P_70 |   1.63e-07   1.40e-07     1.17   0.243    -1.11e-07    4.38e-07
                      P_71 |  -.0003235   .0000835    -3.88   0.000    -.0004873   -.0001598
                      P_72 |   .0000144   5.42e-06     2.66   0.008     3.79e-06    .0000251
                      P_73 |   1.19e-06   3.20e-06     0.37   0.710    -5.09e-06    7.47e-06
                      P_74 |  -.0009062   .0004555    -1.99   0.047    -.0017999   -.0000126
                      P_75 |   .0003413   .0003309     1.03   0.303     -.000308    .0009906
                      P_76 |   .0007433   .0002323     3.20   0.001     .0002876     .001199
                      P_77 |   -.000066   .0000462    -1.43   0.154    -.0001567    .0000247
                      P_78 |  -.0002572   .0002374    -1.08   0.279    -.0007229    .0002086
                      P_79 |  -.0001699   .0002169    -0.78   0.433    -.0005954    .0002556
                      P_80 |  -.0001166   .0000901    -1.29   0.196    -.0002934    .0000601
                      P_81 |   .0052435   .0018375     2.85   0.004     .0016382    .0088487
                      P_82 |   .0691175    .055671     1.24   0.215    -.0401133    .1783483
                      P_83 |   .0692711   .0556708     1.24   0.214    -.0399594    .1785017
                      P_84 |   .0676736   .0556815     1.22   0.224     -.041578    .1769251
                      P_85 |   .0705464     .05567     1.27   0.205    -.0386825    .1797752
                      P_86 |   .0726683    .055761     1.30   0.193    -.0367392    .1820758
                      P_87 |   .0692187   .0556583     1.24   0.214    -.0399872    .1784247
                      P_88 |   .0637814   .0555555     1.15   0.251    -.0452228    .1727856
                      P_89 |   .0623837   .0560728     1.11   0.266    -.0476356     .172403
                      P_90 |   .0729814   .0557778     1.31   0.191    -.0364589    .1824218
                      P_91 |   .0700482   .0557822     1.26   0.209    -.0394009    .1794973
                      P_92 |    .069152   .0556881     1.24   0.215    -.0401125    .1784165
                      P_93 |    .069038    .055673     1.24   0.215    -.0401968    .1782727
                      P_94 |  -.0248541   .0687504    -0.36   0.718    -.1597478    .1100396
                      P_95 |  -.0248761   .0687609    -0.36   0.718    -.1597905    .1100383
                      P_96 |  -.0241177   .0687422    -0.35   0.726    -.1589954      .11076
                      P_97 |   -.024892   .0687608    -0.36   0.717    -.1598061    .1100221
                      P_98 |  -.0273919   .0688727    -0.40   0.691    -.1625256    .1077417
                      P_99 |  -.0245711   .0687582    -0.36   0.721      -.15948    .1103379
                     P_100 |  -.0198481     .06878    -0.29   0.773    -.1547998    .1151037
                     P_101 |  -.0212627   .0686951    -0.31   0.757    -.1560478    .1135225
                     P_102 |   -.033714   .0687065    -0.49   0.624    -.1685215    .1010935
                     P_103 |  -.0260203    .068665    -0.38   0.705    -.1607464    .1087059
                     P_104 |   -.024973   .0687368    -0.36   0.716      -.15984     .109894
                     P_105 |  -.0246906   .0687609    -0.36   0.720    -.1596049    .1102237
                     P_106 |   -.000963   .0006284    -1.53   0.126    -.0021959    .0002699
                     P_107 |  -.0004398    .000591    -0.74   0.457    -.0015993    .0007197
                     P_108 |   .0006662   .0009116     0.73   0.465    -.0011224    .0024548
                     P_109 |   .0000553    .000211     0.26   0.793    -.0003587    .0004693
                     P_110 |   .0031589   .0014115     2.24   0.025     .0003894    .0059283
                     P_111 |   .0001341   .0002684     0.50   0.617    -.0003925    .0006607
                     P_112 |   .0005113   .0002862     1.79   0.074    -.0000502    .0010728
                     P_113 |  -.0002719   .0000759    -3.58   0.000    -.0004209   -.0001229
                     P_114 |   .0000647    .000359     0.18   0.857    -.0006396     .000769
                     P_115 |  -.0001321   .0001944    -0.68   0.497    -.0005136    .0002494
                     P_116 |  -.0018969   .0007885    -2.41   0.016    -.0034439   -.0003498
                     P_117 |  -.0003317   .0001027    -3.23   0.001    -.0005332   -.0001301
                     P_118 |   .0010117   .0002981     3.39   0.001     .0004268    .0015965
                     P_119 |  -.0002207   .0001623    -1.36   0.174    -.0005392    .0000979
                     P_120 |   .0002445   .0002154     1.14   0.256    -.0001781    .0006671
                     P_121 |  -.0005801   .0007891    -0.74   0.462    -.0021282    .0009681
                     _cons |  -4.207986   8.882999    -0.47   0.636    -21.63713    13.22116
--------------------------------------------------------------------------------------------

. 
. predict rank_hat_ols
(option xb assumed; fitted values)
(702 missing values generated)

. scatter kfr_pooled_p25 rank_hat_ols

. 
. // *Now prep data for exporting to R for decision trees and random forests
. 
. *Reorder variables
. order geoid place pop housing kfr_pooled_p25 test training rank_hat_ols

. 
. *Drop counties not in training and not in test data
. drop if training == .
(702 observations deleted)

. 
. *Save data file
. save project4.dta, replace
file project4.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/carrawu/Documents/harvard/ec1152/proj4_save_switch.log
  log type:  text
 closed on:   2 May 2019, 21:20:26
----------------------------------------------------------------------------------------------------
